ProgessBase/Documents/ПРГ_РаспределениеНДС0Ставка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_РаспределениеНДС0Ставка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНДС0</Name>
					<Comment>Сумма выручки, полученной в рамках деятельности облагаемой НДС по ставке 0%</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаНДС</Name>
					<Comment>Сумма выручки, полученной в рамках деятельности облагаемой НДС </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСНДС18</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС18</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСНДС10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСуммаСНДС18</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетНДС18</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСуммаСНДС10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетНДС10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализациия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccumulationRegisters/НДСПредъявленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПредъявленный</Name>
			<Comment>(Регл) НДС, предъявляемый поставщиком</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПокупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПолучениеУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаНДС</Name>
					<Comment>Субсчет 19 счета, на котором учитывается НДС</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_РаспределениеНДС0Ставка/Ext/ObjectModule.bsl
Перем мУдалятьДвижения Экспорт;

Процедура ПроверитьШапкуДокумента(СтруктураШапкиДокумента, Отказ, Заголовок)
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей, Отказ, Заголовок);
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧастиНДС(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураОбязательныхПолей = Новый Структура("Контрагент,Реализациия,Состояние,ВидЦенности,СчетФактура");
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "НДС", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры



Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения = Неопределено,Отказ=ложь) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	Если РежимПроведения = Неопределено Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокументаИПроверитьОтражениеВУчете(ЭтотОбъект, Отказ, Заголовок);
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);

КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента,Отказ,ТаблНДСПредъявл) Экспорт
	Если Отказ Тогда
		возврат;
	КонецЕсли;	
	
	//ТаблНДСПредъявл0 = Движения.НДСПредъявленныйРеализация0.Выгрузить();
	ТаблНДСПредъявл  = Движения.НДСПредъявленный.Выгрузить();
	//ТаблКнигаПродаж  = Движения.НДСЗаписиКнигиПродаж.Выгрузить();
	
	//ТаблКнигаПродаж.Очистить();
	ТаблНДСПредъявл.Очистить();
	ТаблНДСПредъявл.Колонки.Добавить("Покупатель");
	ТаблНДСПредъявл.Колонки.Добавить("ДокументОтгрузки");
	ТаблНДСПредъявл.Колонки.Добавить("ВидЦенностиКП");
	ТаблНДСПредъявл.Колонки.Добавить("Состояние");
	//ТаблНДСПредъявл0.Очистить();
	Сч19 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("19.07");
	
	Для Каждого ТекСтрока Из НДС Цикл
		
		Если ТекСтрока.СуммаСНДС18 > 0 или ТекСтрока.НДС18 > 0 Тогда
			НовСтр = ТаблНДСПредъявл.Добавить();
			НовСтр.Период 			= Дата;
			НовСтр.ВидДвижения      = ВидДвиженияНакопления.Приход;
			НовСтр.Активность 	    = Истина;
			НовСтр.Регистратор	    = Ссылка;
			НовСтр.Организация  	= Организация;
			НовСтр.СчетФактура  	= ТекСтрока.СчетФактура;
			НовСтр.ВидЦенности  	= Перечисления.ВидыЦенностей.Товары;
			НовСтр.ВидЦенностиКП	= ТекСтрока.ВидЦенности;
			НовСтр.СтавкаНДС    	= Перечисления.СтавкиНДС.НДС18;
			НовСтр.СчетУчетаНДС 	= Сч19;
			НовСтр.Поставщик    	= ТекСтрока.Контрагент;
			НовСтр.Покупатель		= ТекСтрока.Контрагент;
			НовСтр.СуммаБезНДС  	= ТекСтрока.СуммаСНДС18 - ТекСтрока.НДС18;
			НовСтр.НДС  			= ТекСтрока.НДС18;
			НовСтр.ДокументОтгрузки = ТекСтрока.Реализациия;
			НовСтр.ДатаСобытия      = Дата;
			НовСтр.Состояние		= ТекСтрока.Состояние;
			
			//НовСтр.Событие		= Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком;
			
		КонецЕсли;	
		
		Если ТекСтрока.СуммаСНДС10 > 0 или ТекСтрока.НДС10 > 0 Тогда
			НовСтр = ТаблНДСПредъявл.Добавить();
			НовСтр.Период 			= Дата;
			НовСтр.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			НовСтр.Активность 	    = Истина;
			НовСтр.Регистратор	    = Ссылка;
			НовСтр.Организация  	= Организация;
			НовСтр.СчетФактура  	= ТекСтрока.СчетФактура;
			НовСтр.ВидЦенности  	= Перечисления.ВидыЦенностей.Товары;
			НовСтр.ВидЦенностиКП	= ТекСтрока.ВидЦенности;
			НовСтр.СтавкаНДС    	= Перечисления.СтавкиНДС.НДС10;
			НовСтр.СчетУчетаНДС 	= Сч19;
			НовСтр.Поставщик    	= ТекСтрока.Контрагент;
			НовСтр.Покупатель		= ТекСтрока.Контрагент;
			НовСтр.СуммаБезНДС  	= ТекСтрока.СуммаСНДС10 - ТекСтрока.НДС10;
			НовСтр.НДС  			= ТекСтрока.НДС10;
			НовСтр.ДокументОтгрузки = ТекСтрока.Реализациия;
			НовСтр.ДатаСобытия      = Дата;
			НовСтр.Состояние		= ТекСтрока.Состояние;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры // СформироватьТаблицыДокумента()

Процедура ДвижениеПоРегистрам(Заголовок,ТаблНДСПредъявл)
	//ТаблНДСПредъявл0 = Движения.НДСПредъявленныйРеализация0.Выгрузить();
	//ТаблНДСПредъявл  = Движения.НДСПредъявленный.Выгрузить();
	//ТаблКнигаПродаж  = Движения.НДСЗаписиКнигиПродаж.Выгрузить();
	
	ТаблНДСПредъявл.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком,"Событие");
	
	Движения.НДСПредъявленный.Загрузить(ТаблНДСПредъявл);
	
	ТаблНДСПредъявл.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПокупки.ПредполагаетсяСтавка0,"Событие");
	
	Движения.НДСПредъявленныйРеализация0.Загрузить(ТаблНДСПредъявл);
	Движения.НДСЗаписиКнигиПродаж.Загрузить(ТаблНДСПредъявл);
	
	Сч68  = ПланыСчетов.Хозрасчетный.НДС;
	
	Проводки = Движения.Хозрасчетный;
	Для Каждого ТекСтрока Из ТаблНДСПредъявл Цикл
		
		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Организация    = Организация;
		НоваяПроводка.Активность	 = Истина;
		НоваяПроводка.Период		 = Дата;
		НоваяПроводка.Содержание 	 = "Восстановление НДС";
		
		НоваяПроводка.Сумма = ТекСтрока.НДС;

		НоваяПроводка.СчетДт = ТекСтрока.СчетУчетаНДС;

		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Контрагенты", ТекСтрока.Покупатель);
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СФПолученные", ТекСтрока.СчетФактура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "ДокументыРеализации", ТекСтрока.ДокументОтгрузки);
											
		НоваяПроводка.СчетКт = Сч68;
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		
	КонецЦикла;	
	
КонецПроцедуры	


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Перем Заголовок,СтруктураШапкиДокумента;
	Перем ТаблНДСПредъявл;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, Истина, РежимПроведения);
	КонецЕсли;
	
	//ВнОбработка = ВнешниеОбработки.Создать("E:\Обработки 1С\НДС Книга продаж покупок\ПровПРГРАспр.epf");
	//ВнОбработка.ОбработкаПроведения(ЭтотОбъект,Ссылка,Отказ, РежимПроведения);
	//ВнОбработка = Неопределено;
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения,Отказ);	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента,Отказ,ТаблНДСПредъявл);
	
	
	Если Не Отказ Тогда
		ДвижениеПоРегистрам(Заголовок,ТаблНДСПредъявл);
	КонецЕслИ;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка = Истина Тогда
		возврат;
	КонецЕслИ;
	
	Если ПометкаУдаления или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		УдалитьСчетаФактуры(РежимЗаписи);
	КонецЕсли;	
	
КонецПроцедуры

Процедура УдалитьСчетаФактуры(РежимЗаписи)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВложенныйЗапрос.СчетФактура КАК ОражениеНачисления
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ПРГ_РаспределениеНДС0СтавкаНДС.СчетФактура КАК СчетФактура
	                      |	ИЗ
	                      |		Документ.ПРГ_РаспределениеНДС0Ставка.НДС КАК ПРГ_РаспределениеНДС0СтавкаНДС
	                      |	ГДЕ
	                      |		ПРГ_РаспределениеНДС0СтавкаНДС.Ссылка = &Ссылка
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ПРГ_РаспределениеНДС0СтавкаНДС.СчетФактура
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ОтражениеРеализацииТоваровИУслугНДС.Ссылка
	                      |	ИЗ
	                      |		Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ОтражениеРеализацииТоваровИУслугНДС
	                      |	ГДЕ
	                      |		ОтражениеРеализацииТоваровИУслугНДС.РасчетныйДокумент = &Ссылка
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ОтражениеРеализацииТоваровИУслугНДС.Ссылка) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.СчетФактура");
						  
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТаблОтражений = Запрос.Выполнить().Выгрузить();	
	для каждого ТекСтрока Из ТаблОтражений Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ОражениеНачисления) Тогда
			Объект = ТекСтрока.ОражениеНачисления.ПолучитьОбъект();
			Если ПометкаУдаления Тогда
				Если Не Объект.ПометкаУдаления Тогда
					Объект.УстановитьПометкуУдаления(Истина);
				КонецЕсли;	
			Иначе
				Если Объект.Проведен и РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
					Объект.Проведен = ложь;
					Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
